DataProcessors/ПолучениеШагов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПолучениеШагов</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ЭкспортныеСценарии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сценарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>550</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКФайлу</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ПолучениеШагов/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
ПутьКФайлу = "C:\repo\eis2-mf\features\Продажи\Продажи - Экспорт сценарий.feature";

//создаем объект для чтения
Текст = Новый ЧтениеТекста(
    ПутьКФайлу, КодировкаТекста.ANSI);

//читаем файл построчно
Пока Истина Цикл
    Строка = Текст.ПрочитатьСтроку("Сценарий:");
    Если Строка = Неопределено Тогда
        Прервать;
    КонецЕсли;
    Сообщить(Строка);
	Запись = Объект.ЭкспортныеСценарии.Добавить();
	Запись.Сценарий = Текст.ПрочитатьСтроку("Сценарий:");
	//Для Каждого 
	//Если Строка = "Сценарий" Тогда
	//	Элементы.ЭкспортныеСценарии.ДобавитьСтроку();
	//	Элементы.ЭкспортныеСценарииСценарий = Строка;
	//ИначеЕсли Строка = "#" Тогда 
	//	Элементы.ЭкспортныеСценарииОписание = Строка;
	//КонецЕсли;
	
	
КонецЦикла;

Текст.Закрыть();

КонецПроцедуры
